InformationRegisters/СчетаУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СчетаУчетаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СчетаУчетаНоменклатуры/Ext/RecordSetModule.bsl
//+++АК Susk (Суслин К.В.) 2018.08.31 б/н 
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ДополнительныеСвойства.Свойство("НеПроверятьНаборПередЗаписью") Тогда
		Возврат;
	КонецЕсли;
	
	МассивНоменклатур = ЭтотОбъект.ВыгрузитьКолонку("Номенклатура");
	
	ЗначенияРеквизитаВидНом = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивНоменклатур, "ВидНоменклатуры");
		
	Для Каждого Ном Из МассивНоменклатур Цикл
		
		Если ЗначенияРеквизитаВидНом[Ном].ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Номенклатура """ + Строка(Ном) + """ имеет вид Товар. Внесение данных о счетах учета - запрещено!", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
